fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_СсылкаНаРеализацию</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_АвтоматическиЗаполненныеДокументы/ВКМ_АвтоматическиЗаполненныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_АвтоматическиЗаполненныеДокументы</name>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСписокПодбора(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ОБъект.ВКМ_Период;
	Диалог.Показать(Новый ОписаниеОповещения("ВКМ_ВыборПериодаЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДолгуюОперацию(Команда)
	
	ДлительнаяОперация = ВыполнитьДолгуюОперациюНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1; 
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершение = Новый ОписаниеОповещения("ОповещениеОЗавершение", ЭтотОбъект);
	//ОповещениеОПрогрессе = Новый ОписаниеОповещения("ОповещениеОПрогрессе", ЭтотОбъект); 
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = ОповещениеОПрогрессе;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершение,ПараметрыОжидания);
	ОповеститьОбИзменении(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	//ВывестиРезультатЗаполненияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_ВыборПериодаЗавершение(Период, ДополнительныеПараметры)Экспорт 
	
	Объект.ВКМ_Период = Период;
	
КонецПроцедуры


&НаСервере
Функция ВыполнитьДолгуюОперациюНаСервере()
	
	
	
	ДатаНачала = Объект.ВКМ_Период.ДатаНачала; 
	ДатаКонца  = Объект.ВКМ_Период.ДатаОкончания;
	
	Если Дата(0001,01,01) = ДатаНачала Тогда
	   Возврат Ложь;	
	КонецЕсли;

	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
	"Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеРеализации", Объект.ВКМ_Период.ДатаНачала,Объект.ВКМ_Период.ДатаОкончания);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ВКМ_СписокДоговоровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЛкСтр = Элемент.ТекущиеДанные;
	Если Поле.Имя = "ВКМ_СписокДоговоровДоговор" Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ",Элемент.ТекущиеДанные.Договор);
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента",ПараметрыФормы);
	ИначеЕсли Поле.Имя = "ВКМ_СписокДоговоровВКМ_СсылкаНаРеализацию" Тогда
		СтандартнаяОбработка = Ложь; 
		ПараметрыФормы = Новый Структура("Ключ",Элемент.ТекущиеДанные.ВКМ_СсылкаНаРеализацию);
		ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента",ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗавершение(Результат,ДополнительныеПараметры)Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда 
		Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура ВывестиРезультатЗаполненияНаСервере()
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Объект.ВКМ_СписокДоговоров.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_АвтоматическиЗаполненныеДокументы.Реализация КАК Реализация,
		|	ВКМ_АвтоматическиЗаполненныеДокументы.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.ВКМ_АвтоматическиЗаполненныеДокументы КАК ВКМ_АвтоматическиЗаполненныеДокументы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.ВКМ_СписокДоговоров.Добавить();
		НоваяСтрока.Договор = ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрока.ВКМ_СсылкаНаРеализацию = ВыборкаДетальныеЗаписи.Реализация;
	КонецЦикла;
	
	наборЗаписей = РегистрыСведений.ВКМ_АвтоматическиЗаполненныеДокументы.СоздатьНаборЗаписей();
	наборЗаписей.Записать();
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРезультатЗаполнения(Команда)
	ВывестиРезультатЗаполненияНаСервере(); 
КонецПроцедуры


#КонецОбласти
